---
kind: property
id: P:Autodesk.Revit.UI.FamilyInstancePlacingArgs.TooltipMessage
source: html/fe9ae0bd-afde-33f2-0c4c-58215ba723fb.htm
---
# Autodesk.Revit.UI.FamilyInstancePlacingArgs.TooltipMessage Property

The message to be shown via tooltip

## Syntax (C#)
```csharp
public string TooltipMessage { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null